# x = input("Введите число: ")
# x = int(x)
# y = x**2

# x = 5
# y = 3
# z = (x != y)
# print(type(z))

# a = 10
# b = 27

# xor = a ^ b

# print(xor)

# 1. Напишите программу, которая запрашивает два целых числа и выводит их сумму
# 2. Напишите программу, которая принимает строку и преобразует ее в целое число
# 3. Напишите программу, которая запрашивает два целых числа и выводит их разность
# 4. Напишите программу, которая запрашивает два дробных числа и выводит их произведение
#  и результат их деления
# 5. Напишите программу, которая принимает число и преобразует его в строку
# 6. Напишите программу, которая запрашивает логическое значение и выводит его
# 7. Напишите программу, которая принимает две строки и складывает их через пробел
# 8. Напишите программу, которая принимает строку и число и выводит результат их сложение (число)
#x = 'Hello'

# '''x = 2
# x = float(x) '''


# a = input("enter boolean value: ")
# a = a == "True"
# print(a)

