# a = True
# b = False

# p = a ^ a
# q = a ^ b
# r = b ^ a
# s = b ^ b
# print(a , "XOR", a, "=", p)
# print(a , "XOR", b, "=", q)
# print(b , "XOR", a, "=", r)
# print(b , "XOR", b, "=", s)

#print("{0:b}".format(15))

# print(15^32)
# print(bin(47))
# print(bin(15))
# print(bin(32))

# num = 0
# if num > 0:
    
#     # какое-то следствие
# elif num < 0:
#     # какое-то следствие
# else:
#     # какое-то следствие

#1. Напишите программу, которая на вход принимает два числа и сравнивает какое больше.
#2. Напишите программу, которая на вход принимает число и выводит четное или нечетное.
#3. Напишите программу, которая на вход принимает число и определяет положительное оно,
#  отриц. или ноль
#4. Напишите программу, которая работает как калькулятор
#5. Напишите программу, которая на вход принимает год и определяет високосный он или нет.
# Високосным считается год, который делится на 4, но не делится на 100,
# за исключением деления на 400.
# Вводим год и переводим его в инт
# Если год % 4 == 0:
    # Если год % 100 == 0:
        # Если год % 400 == 0:
        #       високосный
        # Елс
            #  не високосеный
    #  Елс:
    #       принт не високосный
    # Элс:
        # принт високосный
# Элс:
    # не високосный


#6.  Запросите у пользователя время в часах (от 0 до 23) и выведите:
# •	Утро (с 6 до 11),
# •	День (с 12 до 17),
# •	Вечер (с 18 до 23),
# •	Ночь (с 0 до 5).
#7. Напишите программу, которая проверяет, совпадает ли введённый пользователем пароль 
# с заданным (например, "secret123"). Если совпадает, выводится сообщение "Доступ разрешен",
# в противном случае — "Доступ запрещен".
#8. Напишите программу, которая
#9. Напишите программу, которая:
    # 1.	Запрашивает у пользователя число.
    # 2.	Если число делится на 3, выводит "Fizz".
    # 3.	Если число делится на 5, выводит "Buzz".
    # 4.	Если число делится и на 3, и на 5, выводит "FizzBuzz".
    # 5.	Иначе просто выводит число.

# val = "123"
# print(val.upper())
# print(val.lower())
# print(val.capitalize())
# print(val.title())
# val = val.upper()
# print(val)
# print(val.isalpha())
# print(val.isnumeric())
'''
val = input("enter val: ")
if val.isnumeric():
    val = int(val)
    print(val**3)
else:
    print('Val is not a digit')'''
'''val = input("enter val: ")
val = int(val)
print(val**3)'''
