# saved_pwd = "right_password"
# while input("Введите пароль для входа: ") != saved_pwd: 
# 	pass
# print("Пароль верный. Вход разрешён.")

# Используя while true написать программу проверки пароля которая по условию 
# использует == вместо !=
saved_pwd = "right_password"

while True:
    if input("Введите пароль: ") == saved_pwd:
        print("Everything is fine")
        break

# 1. ... вычисляет сумму всех числе от 1 до 100 включительно используя for. 
# результат вывести на экран
# 2. запрашивает у пользователя строку и выводит каждый символ в новой строке (for)
# 3. запрашивает число у юзера и выводит таблицу умножения этого числа от 1 до 15
# 4. запрашивает у пользователя число n и вычисляет сумму всех четных чисел
# от 1 до n включительно. Используйте цикл for и условие.
# 5. запрашивает у пользователя число n и находит сумму всех чисел от 1 до n, которые делятся
# на 3 без остатка. Используйте цикл while.
# 6. Напишите программу, которая запрашивает у пользователя число и проверяет,
#  является ли оно простым. Число называется простым, если оно делится только 
# на 1 и на само себя. Используйте цикл for для проверки делимости.
